src/Catalogs/КИИ_МоделиИИ/КИИ_МоделиИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_МоделиИИ</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПоляТекста</name>
    <comment>Возможно content или text</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвторизации</name>
    <type>
      <types>EnumRef.КИИ_ТипыАвторизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФорматаAPI</name>
    <type>
      <types>EnumRef.КИИ_ТипыФорматовAPI</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЖизниКеша</name>
    <comment>TTL для записей кеша ответов ИИ в секундах. 0 = не использовать кеш для модели. Дефолт 86400 (24ч).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыКеша</name>
    <comment>Версия контракта нормализации ключа кеша для этой модели. Инкремент = все старые записи кеша протухли. Дефолт 1.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодели</name>
    <comment>Чат / Эмбеддинг — разделение chat vs embedding.</comment>
    <type>
      <types>EnumRef.КИИ_ТипыМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>EndpointЭмбеддингов</name>
    <comment>Напр. /v1/embeddings (если ТипМодели=Эмбеддинг).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерностьЭмбеддинга</name>
    <comment>1536/256.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксТокеновВхода</name>
    <comment>Лимит для чанкера.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассEgress</name>
    <comment>РФ/внешний — матчится с политикой документа.</comment>
    <type>
      <types>EnumRef.КИИ_ПолитикиЭмбеддинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживаетИнструменты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КИИ_МоделиИИ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Заполняет справочник предустановленными моделями ИИ из макета
//
Процедура ЗаполнитьПредустановленныеМодели() Экспорт
	
	МакетJSON = ПолучитьМакет("ПредустановленныеМодели");
	ТекстJSON = МакетJSON.ПолучитьТекст();
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		МассивМоделей = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
	Исключение
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка парсинга JSON макета: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.Заполнение моделей'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Если ТипЗнч(МассивМоделей) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'Макет должен содержать массив моделей'");
	КонецЕсли;
	
	КоличествоСоздано = 0;
	КоличествоОбновлено = 0;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ДанныеМодели Из МассивМоделей Цикл
			
			Если СоздатьИлиОбновитьМодель(ДанныеМодели) Тогда
				КоличествоСоздано = КоличествоСоздано + 1;
			Иначе
				КоличествоОбновлено = КоличествоОбновлено + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка заполнения моделей: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.Заполнение моделей'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	СообщениеЛога = СтрШаблон(
		НСтр("ru = 'Заполнение моделей завершено. Создано: %1, обновлено: %2'"),
		КоличествоСоздано,
		КоличествоОбновлено);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'КИИ.Заполнение моделей'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		СообщениеЛога);
	
КонецПроцедуры

// Проверяет наличие моделей в справочнике
//
// Возвращаемое значение:
//  Булево - Истина, если в справочнике есть хотя бы одна модель
//
Функция МоделиЗаполнены() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КИИ_МоделиИИ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КИИ_МоделиИИ КАК КИИ_МоделиИИ
		|ГДЕ
		|	НЕ КИИ_МоделиИИ.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подгоняет строку под максимальную длину реквизита. Значение длиннее лимита обрезается
// (иначе платформа усекла бы его молча при записи, ломая длинные адреса/токены из макета).
// Чистая функция - юнит-тестируется без записи объекта.
//
// Параметры:
//   Значение          - Строка, Произвольный - исходное значение (не-строка возвращается как есть).
//   МаксимальнаяДлина  - Число - лимит; 0 означает неограниченную длину (не обрезаем).
//
// Возвращаемое значение:
//   Структура:
//    * Значение      - Строка - подогнанное значение.
//    * Усечено       - Булево - пришлось ли обрезать.
//    * ИсходнаяДлина  - Число  - длина исходного значения.
Функция ПодогнатьСтрокуПодДлину(Знач Значение, Знач МаксимальнаяДлина) Экспорт

	Итог = Новый Структура("Значение, Усечено, ИсходнаяДлина", Значение, Ложь, 0);
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Итог;
	КонецЕсли;

	Итог.ИсходнаяДлина = СтрДлина(Значение);
	Если МаксимальнаяДлина > 0 И Итог.ИсходнаяДлина > МаксимальнаяДлина Тогда
		Итог.Значение = Лев(Значение, МаксимальнаяДлина);
		Итог.Усечено = Истина;
	КонецЕсли;
	Возврат Итог;

КонецФункции

// Длина квалификатора строки реквизита (корневого или реквизита ТЧ) справочника Модели ИИ.
// 0 - реквизит не строковый / не найден / неограниченная длина.
Функция ДлинаСтроковогоРеквизита(ИмяРеквизита, ИмяТабличнойЧасти = "")

	Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
		КоллекцияРеквизитов = Метаданные.Справочники.КИИ_МоделиИИ.Реквизиты;
	Иначе
		ТабЧасть = Метаданные.Справочники.КИИ_МоделиИИ.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		Если ТабЧасть = Неопределено Тогда
			Возврат 0;
		КонецЕсли;
		КоллекцияРеквизитов = ТабЧасть.Реквизиты;
	КонецЕсли;

	Реквизит = КоллекцияРеквизитов.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Реквизит.Тип.КвалификаторыСтроки.Длина;

КонецФункции

// Присваивает строковый реквизит с подгонкой под его длину; усечение пишет предупреждением в ЖР.
Процедура УстановитьСтроковыйРеквизит(МодельОбъект, ИмяРеквизита, Значение)

	Итог = ПодогнатьСтрокуПодДлину(Значение, ДлинаСтроковогоРеквизита(ИмяРеквизита));
	Если Итог.Усечено Тогда
		ТекстДляЖурнала = СтрШаблон(
			НСтр("ru = 'Значение реквизита ""%1"" модели ""%2"" усечено с %3 до %4 символов при импорте.'"),
			ИмяРеквизита, МодельОбъект.Наименование, Итог.ИсходнаяДлина, СтрДлина(Итог.Значение));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.ИмпортМоделей'"),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстДляЖурнала);
	КонецЕсли;
	МодельОбъект[ИмяРеквизита] = Итог.Значение;

КонецПроцедуры

// Значение реквизита табличной части с подгонкой под его длину; усечение пишет
// предупреждение в журнал (молча резать HTTP-заголовок нельзя - он перестанет работать).
Функция ЗначениеРеквизитаТабличнойЧасти(МодельОбъект, ИмяТабличнойЧасти, ИмяРеквизита, Значение)

	Итог = ПодогнатьСтрокуПодДлину(Значение, ДлинаСтроковогоРеквизита(ИмяРеквизита, ИмяТабличнойЧасти));
	Если Итог.Усечено Тогда
		ТекстДляЖурнала = СтрШаблон(
			НСтр("ru = 'Значение ""%1.%2"" модели ""%3"" усечено с %4 до %5 символов при импорте.'"),
			ИмяТабличнойЧасти, ИмяРеквизита, МодельОбъект.Наименование,
			Итог.ИсходнаяДлина, СтрДлина(Итог.Значение));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.ИмпортМоделей'"),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстДляЖурнала);
	КонецЕсли;
	Возврат Итог.Значение;

КонецФункции

Функция СоздатьИлиОбновитьМодель(ДанныеМодели)
	
	Если Не ЗначениеЗаполнено(ДанныеМодели.Наименование) Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствует обязательное поле ""Наименование""'");
	КонецЕсли;
	
	// Наименование - ключ поиска: усечение платформой при записи расходилось бы с полным
	// значением поиска (повторный импорт не нашел бы модель и создал дубль). Поэтому
	// нормализуем ОДИН раз и дальше используем нормализованное и для поиска, и для записи.
	ИтогНаименования = ПодогнатьСтрокуПодДлину(ДанныеМодели.Наименование,
		Метаданные.Справочники.КИИ_МоделиИИ.ДлинаНаименования);
	Если ИтогНаименования.Усечено Тогда
		ТекстДляЖурнала = СтрШаблон(
			НСтр("ru = 'Наименование модели усечено с %1 до %2 символов при импорте: ""%3"".'"),
			ИтогНаименования.ИсходнаяДлина, СтрДлина(ИтогНаименования.Значение), ИтогНаименования.Значение);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.ИмпортМоделей'"),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстДляЖурнала);
	КонецЕсли;
	Наименование = ИтогНаименования.Значение;

	СсылкаНаМодель = НайтиПоНаименованию(Наименование);
	
	Если ЗначениеЗаполнено(СсылкаНаМодель) Тогда
		МодельОбъект = СсылкаНаМодель.ПолучитьОбъект();
		Создана = Ложь;
	Иначе
		МодельОбъект = СоздатьЭлемент();
		МодельОбъект.Заполнить(Неопределено);
		МодельОбъект.Наименование = Наименование;
		Создана = Истина;
	КонецЕсли;
	
	ЗаполнитьРеквизитыМодели(МодельОбъект, ДанныеМодели);
	ЗаполнитьЗаголовкиМодели(МодельОбъект, ДанныеМодели);
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.КИИ_МоделиИИ");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", МодельОбъект.Ссылка);
	Попытка
		Блокировка.Заблокировать();
		МодельОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Создана;
	
КонецФункции

Процедура ЗаполнитьРеквизитыМодели(МодельОбъект, ДанныеМодели)
	
	УстановитьОбязательныйСтроковыйРеквизит(МодельОбъект, ДанныеМодели, "НаименованиеПолное");
	УстановитьОбязательныйСтроковыйРеквизит(МодельОбъект, ДанныеМодели, "Адрес");
	УстановитьОбязательныйСтроковыйРеквизит(МодельОбъект, ДанныеМодели, "АдресЗапроса");
	
	// Защищенное соединение по умолчанию включено - выключается только явным значением из данных.
	МодельОбъект.ИспользоватьЗащищенноеСоединение = Истина;
	Если ДанныеМодели.Свойство("ИспользоватьЗащищенноеСоединение") Тогда
		МодельОбъект.ИспользоватьЗащищенноеСоединение = ДанныеМодели.ИспользоватьЗащищенноеСоединение;
	КонецЕсли;
	
	// Строковые с подгонкой под длину реквизита (усечение логируется).
	ОпциональныеСтроковые = СтрРазделить("НаименованиеПровайдера,ИмяПоляТекста,Описание", ",");
	Для Каждого ИмяРеквизита Из ОпциональныеСтроковые Цикл
		Если ДанныеМодели.Свойство(ИмяРеквизита) Тогда
			УстановитьСтроковыйРеквизит(МодельОбъект, ИмяРеквизита, ДанныеМодели[ИмяРеквизита]);
		КонецЕсли;
	КонецЦикла;
	
	// Числовые, булевы и строки без подгонки длины - копируются как есть.
	ПрямыеРеквизиты = СтрРазделить("Температура,МаксимумТокенов,Таймаут,ПоддерживаетИнструменты,"
		+ "ИспользоватьПрокси,СрокЖизниКеша,EndpointЭмбеддингов,РазмерностьЭмбеддинга,МаксТокеновВхода", ",");
	Для Каждого ИмяРеквизита Из ПрямыеРеквизиты Цикл
		Если ДанныеМодели.Свойство(ИмяРеквизита) Тогда
			МодельОбъект[ИмяРеквизита] = ДанныеМодели[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	УстановитьРеквизитПеречисления(МодельОбъект, ДанныеМодели, "ТипФорматаAPI", Перечисления.КИИ_ТипыФорматовAPI);
	УстановитьРеквизитПеречисления(МодельОбъект, ДанныеМодели, "ТипАвторизации", Перечисления.КИИ_ТипыАвторизации);
	УстановитьРеквизитПеречисления(МодельОбъект, ДанныеМодели, "ТипМодели", Перечисления.КИИ_ТипыМоделей);
	УстановитьРеквизитПеречисления(МодельОбъект, ДанныеМодели, "КлассEgress", Перечисления.КИИ_ПолитикиЭмбеддинга);
	
КонецПроцедуры

// Проверяет наличие обязательного строкового поля и присваивает его с подгонкой длины.
Процедура УстановитьОбязательныйСтроковыйРеквизит(МодельОбъект, ДанныеМодели, Знач ИмяРеквизита)

	Если Не ЗначениеЗаполнено(ДанныеМодели[ИмяРеквизита]) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Отсутствует обязательное поле ""%1""'"), ИмяРеквизита);
	КонецЕсли;
	УстановитьСтроковыйРеквизит(МодельОбъект, ИмяРеквизита, ДанныеМодели[ИмяРеквизита]);

КонецПроцедуры

// Присваивает реквизит-перечисление по строковому имени значения из данных импорта.
Процедура УстановитьРеквизитПеречисления(МодельОбъект, ДанныеМодели, Знач ИмяРеквизита, Знач МенеджерПеречисления)

	Если ДанныеМодели.Свойство(ИмяРеквизита) И ЗначениеЗаполнено(ДанныеМодели[ИмяРеквизита]) Тогда
		МодельОбъект[ИмяРеквизита] = МенеджерПеречисления[ДанныеМодели[ИмяРеквизита]];
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЗаголовкиМодели(МодельОбъект, ДанныеМодели)
	
	Если Не ДанныеМодели.Свойство("Заголовки") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеМодели.Заголовки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	МодельОбъект.Заголовки.Очистить();
	
	Для Каждого ДанныеЗаголовка Из ДанныеМодели.Заголовки Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеЗаголовка.Ключ) Или Не ЗначениеЗаполнено(ДанныеЗаголовка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = МодельОбъект.Заголовки.Добавить();
		НоваяСтрока.Ключ = ЗначениеРеквизитаТабличнойЧасти(МодельОбъект, "Заголовки", "Ключ",
			ДанныеЗаголовка.Ключ);
		НоваяСтрока.Значение = ЗначениеРеквизитаТабличнойЧасти(МодельОбъект, "Заголовки", "Значение",
			ДанныеЗаголовка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
